{
  "Navigation": {
    "home": "Главная",
    "editor": "Редактор"
  },
  "Home": {
    "title": "9 Patch Editor — онлайн-инструмент WYSIWYG для создания 9 изображений патчей",
    "description": "9 Patch Editor — это онлайн-инструмент WYSIWYG, аналогичный тому, который включен в Android Studio. Этот инструмент позволяет создавать растровые изображения, размер которых автоматически изменяется в соответствии с содержимым представления и размером экрана. Вы можете масштабировать выбранные части изображения по горизонтали или по вертикали в зависимости от индикаторов, нарисованных на изображении.",
    "try": "Попробуй это сейчас!",
    "use": {
      "title": "Как использовать",
      "description": "Выполните следующие шаги, чтобы создать изображение NinePatch с помощью редактора 9 Patch Editor. Вам понадобится образ, из которого вы хотите создать образ NinePatch.",
      "1": {
        "title": "Нажмите кнопку <strong>Select image</strong> или перетащите изображение в редактор, из которого вы хотите создать изображение NinePatch.",
        "description": "В открывшейся рабочей области центральная панель — это область рисования, где вы можете редактировать линии растягиваемых фрагментов и область содержимого. Правая панель — это область предварительного просмотра, где вы можете просмотреть растянутую графику."
      },
      "2": {
        "title": "Измените имя изображения для вашего образа NinePatch. Ваше изображение будет сохранено с расширением файла <code>.9.png</code>.",
        "description": ""
      },
      "3": {
        "title": "Щелкните по периметру размером в 1 пиксель, чтобы нарисовать линии, определяющие растягиваемые фрагменты и (необязательно) область содержимого.",
        "description": ""
      },
      "4": {
        "title": "Когда закончите, нажмите кнопку <strong>Save image</strong>, чтобы сохранить изменения.",
        "description": ""
      },
      "content": "Чтобы убедиться, что ваша графика NinePatch правильно масштабируется, убедитесь, что все растягиваемые области имеют размер не менее 2x2 пикселей. В противном случае эти регионы могут исчезнуть при уменьшении масштаба. Чтобы избежать интерполяции во время масштабирования, которая может привести к изменению цвета на границах, обеспечьте 1 пиксель дополнительного безопасного пространства в графике до и после растягиваемых областей.",
      "note": "<strong>Примечание:</strong> Обычный файл PNG (<code>*.png</code>) загружается с добавленной вокруг изображения пустой рамкой толщиной в 1 пиксель. Вы можете нарисовать растягиваемые фрагменты и область содержимого внутри границы. Ранее сохраненный файл NinePatch (<code>*.9.png</code>) загружается как есть, без добавления области рисования, поскольку она уже существует.",
      "image": "<strong>Рисунок 1.</strong> 9 Patch Editor, отображающий изображение NinePatch."
    },
    "options": {
      "title": "Дополнительные элементы управления",
      "1": "<strong>Масштаб</strong>: настройте масштаб графики в области рисования.",
      "2": "<strong>Масштаб заплаток</strong>: настройте масштаб изображений в области предварительного просмотра.",
      "3": "<strong>Показать блокировку</strong>: визуализируйте неизменяемую область графики при наведении мыши.",
      "4": "<strong>Показать заплатки</strong>: просмотрите розовые растяжимые заплатки в области рисования. Розовый цвет обозначает растяжимую заплатку, как показано на рисунке 2.",
      "5": "<strong>Показать содержимое</strong>: выделите область содержимого в изображениях предварительного просмотра. Фиолетовый обозначает область, где разрешено содержимое, как показано на рисунке 2.",
      "6": "<strong>Показать плохие заплатки</strong>: добавляет красную границу вокруг областей заплаток, которые могут привести к искажениям в графике при растяжении, как показано на рисунке 2. Если вы устраните все плохие заплатки, вы сохраните визуальную целостность вашего растянутого изображения.",
      "image": "<strong>Рисунок 2.</strong> Изображение NinePatch в редакторе, показывающее содержимое, исправления и плохие исправления."
    },
    "links": "Ссылки:",
    "reserved": "Все права защищены."
  },
  "Metadata": {
    "home": {
      "title": "9 Patch Editor — онлайн-инструмент WYSIWYG для создания 9 изображений патчей",
      "description": "Легко превратите любое растровое изображение в изображение с 9 патчами с помощью этого замечательного онлайн-инструмента WYSIWYG. Быстро создавайте растягиваемые растровые изображения для гибких пользовательских интерфейсов. Попробуйте этот инструмент прямо сейчас!",
      "keywords": "9-patch,9patch,.9.png,.9 png,9 patch online,9 patch generator,flutter web ui,.9图,点9图,draw9patch,NinePatch,NinePatchChunk,NinePatchDrawable,WYSIWYG editor"
    },
    "editor": {
      "title": "9 Patch Editor",
      "description": "Потрясающий онлайн-инструмент WYSIWYG для создания 9 изображений патчей, созданных с помощью Flutter."
    }
  }
}
